Microchip-MPLAB-Harmony/smartenergy/apps/dual_core_demo/firmware/src/packs/PIC32CX2051MTSH128S1_DFP/component/slcdc.h
/* -------- SLCDC_DR : (SLCDC Offset: 0x0C) (R/W 32) Display Register -------- */
#define SLCDC_DR_DISPMODE_Pos                 _UINT32_(0)                                          /* (SLCDC_DR) Display Mode Register Position */
#define SLCDC_DR_DISPMODE_Msk                 (_UINT32_(0x7) << SLCDC_DR_DISPMODE_Pos)             /* (SLCDC_DR) Display Mode Register Mask */
#define SLCDC_DR_DISPMODE(value)              (SLCDC_DR_DISPMODE_Msk & (_UINT32_(value) << SLCDC_DR_DISPMODE_Pos)) /* Assigment of value for DISPMODE in the SLCDC_DR register */
#define   SLCDC_DR_DISPMODE_NORMAL_Val        _UINT32_(0x0)                                        /* (SLCDC_DR) Normal Mode-Latched data are displayed.  */
#define   SLCDC_DR_DISPMODE_FORCE_OFF_Val     _UINT32_(0x1)                                        /* (SLCDC_DR) Force Off Mode-All pixels are invisible. (The SLCDC memory is unchanged.)  */
#define   SLCDC_DR_DISPMODE_FORCE_ON_Val      _UINT32_(0x2)                                        /* (SLCDC_DR) Force On Mode-All pixels are visible. (The SLCDC memory is unchanged.)  */
#define   SLCDC_DR_DISPMODE_BLINKING_Val      _UINT32_(0x3)                                        /* (SLCDC_DR) Blinking Mode-All pixels are alternately turned off to the predefined state in SLCDC memory at LCDBLKFREQ frequency. (The SLCDC memory is unchanged.)  */
#define   SLCDC_DR_DISPMODE_INVERTED_Val      _UINT32_(0x4)                                        /* (SLCDC_DR) Inverted Mode-All pixels are set in the inverted state as defined in SLCDC memory. (The SLCDC memory is unchanged.)  */
#define   SLCDC_DR_DISPMODE_INVERTED_BLINK_Val _UINT32_(0x5)                                        /* (SLCDC_DR) Inverted Blinking Mode-All pixels are alternately turned off to the predefined opposite state in SLCDC memory at LCDBLKFREQ frequency. (The SLCDC memory is unchanged.)  */
#define   SLCDC_DR_DISPMODE_USER_BUFFER_LOAD_Val _UINT32_(0x6)                                        /* (SLCDC_DR) User Buffer Only Load Mode-Blocks the automatic transfer from User Buffer to Display Buffer.  */
#define   SLCDC_DR_DISPMODE_BUFFERS_SWAP_Val  _UINT32_(0x7)                                        /* (SLCDC_DR) Buffer Swap Mode-All pixels are alternatively assigned to the state defined in the User Buffer, then to the state defined in the Display Buffer at LCDBLKFREQ frequency.  */
#define SLCDC_DR_DISPMODE_NORMAL              (SLCDC_DR_DISPMODE_NORMAL_Val << SLCDC_DR_DISPMODE_Pos) /* (SLCDC_DR) Normal Mode-Latched data are displayed. Position  */
#define SLCDC_DR_DISPMODE_FORCE_OFF           (SLCDC_DR_DISPMODE_FORCE_OFF_Val << SLCDC_DR_DISPMODE_Pos) /* (SLCDC_DR) Force Off Mode-All pixels are invisible. (The SLCDC memory is unchanged.) Position  */
#define SLCDC_DR_DISPMODE_FORCE_ON            (SLCDC_DR_DISPMODE_FORCE_ON_Val << SLCDC_DR_DISPMODE_Pos) /* (SLCDC_DR) Force On Mode-All pixels are visible. (The SLCDC memory is unchanged.) Position  */
#define SLCDC_DR_DISPMODE_BLINKING            (SLCDC_DR_DISPMODE_BLINKING_Val << SLCDC_DR_DISPMODE_Pos) /* (SLCDC_DR) Blinking Mode-All pixels are alternately turned off to the predefined state in SLCDC memory at LCDBLKFREQ frequency. (The SLCDC memory is unchanged.) Position  */
#define SLCDC_DR_DISPMODE_INVERTED            (SLCDC_DR_DISPMODE_INVERTED_Val << SLCDC_DR_DISPMODE_Pos) /* (SLCDC_DR) Inverted Mode-All pixels are set in the inverted state as defined in SLCDC memory. (The SLCDC memory is unchanged.) Position  */
#define SLCDC_DR_DISPMODE_INVERTED_BLINK      (SLCDC_DR_DISPMODE_INVERTED_BLINK_Val << SLCDC_DR_DISPMODE_Pos) /* (SLCDC_DR) Inverted Blinking Mode-All pixels are alternately turned off to the predefined opposite state in SLCDC memory at LCDBLKFREQ frequency. (The SLCDC memory is unchanged.) Position  */
#define SLCDC_DR_DISPMODE_USER_BUFFER_LOAD    (SLCDC_DR_DISPMODE_USER_BUFFER_LOAD_Val << SLCDC_DR_DISPMODE_Pos) /* (SLCDC_DR) User Buffer Only Load Mode-Blocks the automatic transfer from User Buffer to Display Buffer. Position  */
#define SLCDC_DR_DISPMODE_BUFFERS_SWAP        (SLCDC_DR_DISPMODE_BUFFERS_SWAP_Val << SLCDC_DR_DISPMODE_Pos) /* (SLCDC_DR) Buffer Swap Mode-All pixels are alternatively assigned to the state defined in the User Buffer, then to the state defined in the Display Buffer at LCDBLKFREQ frequency. Position  */
#define SLCDC_DR_LCDBLKFREQ_Pos               _UINT32_(8)                                          /* (SLCDC_DR) LCD Blinking Frequency Selection Position */
#define SLCDC_DR_LCDBLKFREQ_Msk               (_UINT32_(0xFF) << SLCDC_DR_LCDBLKFREQ_Pos)          /* (SLCDC_DR) LCD Blinking Frequency Selection Mask */
#define SLCDC_DR_LCDBLKFREQ(value)            (SLCDC_DR_LCDBLKFREQ_Msk & (_UINT32_(value) << SLCDC_DR_LCDBLKFREQ_Pos)) /* Assigment of value for LCDBLKFREQ in the SLCDC_DR register */
#define SLCDC_DR_Msk                          _UINT32_(0x0000FF07)                                 /* (SLCDC_DR) Register Mask  */


/* -------- SLCDC_SR : (SLCDC Offset: 0x10) ( R/ 32) Status Register -------- */
#define SLCDC_SR_ENA_Pos                      _UINT32_(0)                                          /* (SLCDC_SR) Enable Status (Automatically Set/Reset) Position */
#define SLCDC_SR_ENA_Msk                      (_UINT32_(0x1) << SLCDC_SR_ENA_Pos)                  /* (SLCDC_SR) Enable Status (Automatically Set/Reset) Mask */
#define SLCDC_SR_ENA(value)                   (SLCDC_SR_ENA_Msk & (_UINT32_(value) << SLCDC_SR_ENA_Pos)) /* Assigment of value for ENA in the SLCDC_SR register */
#define SLCDC_SR_DFFRZS_Pos                   _UINT32_(6)                                          /* (SLCDC_SR) Display Panel Features Configuration Freeze Status Position */
#define SLCDC_SR_DFFRZS_Msk                   (_UINT32_(0x1) << SLCDC_SR_DFFRZS_Pos)               /* (SLCDC_SR) Display Panel Features Configuration Freeze Status Mask */
#define SLCDC_SR_DFFRZS(value)                (SLCDC_SR_DFFRZS_Msk & (_UINT32_(value) << SLCDC_SR_DFFRZS_Pos)) /* Assigment of value for DFFRZS in the SLCDC_SR register */
#define SLCDC_SR_MAPFRZS_Pos                  _UINT32_(7)                                          /* (SLCDC_SR) Remapping Configuration Freeze Status Position */
#define SLCDC_SR_MAPFRZS_Msk                  (_UINT32_(0x1) << SLCDC_SR_MAPFRZS_Pos)              /* (SLCDC_SR) Remapping Configuration Freeze Status Mask */
#define SLCDC_SR_MAPFRZS(value)               (SLCDC_SR_MAPFRZS_Msk & (_UINT32_(value) << SLCDC_SR_MAPFRZS_Pos)) /* Assigment of value for MAPFRZS in the SLCDC_SR register */
#define SLCDC_SR_Msk                          _UINT32_(0x000000C1)                                 /* (SLCDC_SR) Register Mask  */


