Microchip-MPLAB-Harmony/smartenergy/apps/dual_core_demo/firmware/src/packs/PIC32CX2051MTSH128S1_DFP/component/slcdc.h
/* -------- SLCDC_IER : (SLCDC Offset: 0x20) ( /W 32) Interrupt Enable Register -------- */
#define SLCDC_IER_ENDFRAME_Pos                _UINT32_(0)                                          /* (SLCDC_IER) End of Frame Interrupt Enable Position */
#define SLCDC_IER_ENDFRAME_Msk                (_UINT32_(0x1) << SLCDC_IER_ENDFRAME_Pos)            /* (SLCDC_IER) End of Frame Interrupt Enable Mask */
#define SLCDC_IER_ENDFRAME(value)             (SLCDC_IER_ENDFRAME_Msk & (_UINT32_(value) << SLCDC_IER_ENDFRAME_Pos)) /* Assigment of value for ENDFRAME in the SLCDC_IER register */
#define SLCDC_IER_DIS_Pos                     _UINT32_(2)                                          /* (SLCDC_IER) Disable Completion Interrupt Enable Position */
#define SLCDC_IER_DIS_Msk                     (_UINT32_(0x1) << SLCDC_IER_DIS_Pos)                 /* (SLCDC_IER) Disable Completion Interrupt Enable Mask */
#define SLCDC_IER_DIS(value)                  (SLCDC_IER_DIS_Msk & (_UINT32_(value) << SLCDC_IER_DIS_Pos)) /* Assigment of value for DIS in the SLCDC_IER register */
#define SLCDC_IER_Msk                         _UINT32_(0x00000005)                                 /* (SLCDC_IER) Register Mask  */


/* -------- SLCDC_IDR : (SLCDC Offset: 0x24) ( /W 32) Interrupt Disable Register -------- */
#define SLCDC_IDR_ENDFRAME_Pos                _UINT32_(0)                                          /* (SLCDC_IDR) End of Frame Interrupt Disable Position */
#define SLCDC_IDR_ENDFRAME_Msk                (_UINT32_(0x1) << SLCDC_IDR_ENDFRAME_Pos)            /* (SLCDC_IDR) End of Frame Interrupt Disable Mask */
#define SLCDC_IDR_ENDFRAME(value)             (SLCDC_IDR_ENDFRAME_Msk & (_UINT32_(value) << SLCDC_IDR_ENDFRAME_Pos)) /* Assigment of value for ENDFRAME in the SLCDC_IDR register */
#define SLCDC_IDR_DIS_Pos                     _UINT32_(2)                                          /* (SLCDC_IDR) Disable Completion Interrupt Disable Position */
#define SLCDC_IDR_DIS_Msk                     (_UINT32_(0x1) << SLCDC_IDR_DIS_Pos)                 /* (SLCDC_IDR) Disable Completion Interrupt Disable Mask */
#define SLCDC_IDR_DIS(value)                  (SLCDC_IDR_DIS_Msk & (_UINT32_(value) << SLCDC_IDR_DIS_Pos)) /* Assigment of value for DIS in the SLCDC_IDR register */
#define SLCDC_IDR_Msk                         _UINT32_(0x00000005)                                 /* (SLCDC_IDR) Register Mask  */


/* -------- SLCDC_IMR : (SLCDC Offset: 0x28) ( R/ 32) Interrupt Mask Register -------- */
#define SLCDC_IMR_ENDFRAME_Pos                _UINT32_(0)                                          /* (SLCDC_IMR) End of Frame Interrupt Mask Position */
#define SLCDC_IMR_ENDFRAME_Msk                (_UINT32_(0x1) << SLCDC_IMR_ENDFRAME_Pos)            /* (SLCDC_IMR) End of Frame Interrupt Mask Mask */
#define SLCDC_IMR_ENDFRAME(value)             (SLCDC_IMR_ENDFRAME_Msk & (_UINT32_(value) << SLCDC_IMR_ENDFRAME_Pos)) /* Assigment of value for ENDFRAME in the SLCDC_IMR register */
#define SLCDC_IMR_DIS_Pos                     _UINT32_(2)                                          /* (SLCDC_IMR) Disable Completion Interrupt Mask Position */
#define SLCDC_IMR_DIS_Msk                     (_UINT32_(0x1) << SLCDC_IMR_DIS_Pos)                 /* (SLCDC_IMR) Disable Completion Interrupt Mask Mask */
#define SLCDC_IMR_DIS(value)                  (SLCDC_IMR_DIS_Msk & (_UINT32_(value) << SLCDC_IMR_DIS_Pos)) /* Assigment of value for DIS in the SLCDC_IMR register */
#define SLCDC_IMR_Msk                         _UINT32_(0x00000005)                                 /* (SLCDC_IMR) Register Mask  */


/* -------- SLCDC_ISR : (SLCDC Offset: 0x2C) ( R/ 32) Interrupt Status Register -------- */
#define SLCDC_ISR_ENDFRAME_Pos                _UINT32_(0)                                          /* (SLCDC_ISR) End of Frame Interrupt Status Position */
#define SLCDC_ISR_ENDFRAME_Msk                (_UINT32_(0x1) << SLCDC_ISR_ENDFRAME_Pos)            /* (SLCDC_ISR) End of Frame Interrupt Status Mask */
#define SLCDC_ISR_ENDFRAME(value)             (SLCDC_ISR_ENDFRAME_Msk & (_UINT32_(value) << SLCDC_ISR_ENDFRAME_Pos)) /* Assigment of value for ENDFRAME in the SLCDC_ISR register */
#define SLCDC_ISR_DIS_Pos                     _UINT32_(2)                                          /* (SLCDC_ISR) Disable Completion Interrupt Status Position */
#define SLCDC_ISR_DIS_Msk                     (_UINT32_(0x1) << SLCDC_ISR_DIS_Pos)                 /* (SLCDC_ISR) Disable Completion Interrupt Status Mask */
#define SLCDC_ISR_DIS(value)                  (SLCDC_ISR_DIS_Msk & (_UINT32_(value) << SLCDC_ISR_DIS_Pos)) /* Assigment of value for DIS in the SLCDC_ISR register */
#define SLCDC_ISR_Msk                         _UINT32_(0x00000005)                                 /* (SLCDC_ISR) Register Mask  */


/* -------- SLCDC_SMR0 : (SLCDC Offset: 0x30) (R/W 32) Segment Map Register 0 -------- */
#define SLCDC_SMR0_LCD0_Pos                   _UINT32_(0)                                          /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD0_Msk                   (_UINT32_(0x1) << SLCDC_SMR0_LCD0_Pos)               /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD0(value)                (SLCDC_SMR0_LCD0_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD0_Pos)) /* Assigment of value for LCD0 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD1_Pos                   _UINT32_(1)                                          /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD1_Msk                   (_UINT32_(0x1) << SLCDC_SMR0_LCD1_Pos)               /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD1(value)                (SLCDC_SMR0_LCD1_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD1_Pos)) /* Assigment of value for LCD1 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD2_Pos                   _UINT32_(2)                                          /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD2_Msk                   (_UINT32_(0x1) << SLCDC_SMR0_LCD2_Pos)               /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD2(value)                (SLCDC_SMR0_LCD2_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD2_Pos)) /* Assigment of value for LCD2 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD3_Pos                   _UINT32_(3)                                          /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD3_Msk                   (_UINT32_(0x1) << SLCDC_SMR0_LCD3_Pos)               /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD3(value)                (SLCDC_SMR0_LCD3_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD3_Pos)) /* Assigment of value for LCD3 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD4_Pos                   _UINT32_(4)                                          /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD4_Msk                   (_UINT32_(0x1) << SLCDC_SMR0_LCD4_Pos)               /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD4(value)                (SLCDC_SMR0_LCD4_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD4_Pos)) /* Assigment of value for LCD4 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD5_Pos                   _UINT32_(5)                                          /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD5_Msk                   (_UINT32_(0x1) << SLCDC_SMR0_LCD5_Pos)               /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD5(value)                (SLCDC_SMR0_LCD5_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD5_Pos)) /* Assigment of value for LCD5 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD6_Pos                   _UINT32_(6)                                          /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD6_Msk                   (_UINT32_(0x1) << SLCDC_SMR0_LCD6_Pos)               /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD6(value)                (SLCDC_SMR0_LCD6_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD6_Pos)) /* Assigment of value for LCD6 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD7_Pos                   _UINT32_(7)                                          /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD7_Msk                   (_UINT32_(0x1) << SLCDC_SMR0_LCD7_Pos)               /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD7(value)                (SLCDC_SMR0_LCD7_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD7_Pos)) /* Assigment of value for LCD7 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD8_Pos                   _UINT32_(8)                                          /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD8_Msk                   (_UINT32_(0x1) << SLCDC_SMR0_LCD8_Pos)               /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD8(value)                (SLCDC_SMR0_LCD8_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD8_Pos)) /* Assigment of value for LCD8 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD9_Pos                   _UINT32_(9)                                          /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD9_Msk                   (_UINT32_(0x1) << SLCDC_SMR0_LCD9_Pos)               /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD9(value)                (SLCDC_SMR0_LCD9_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD9_Pos)) /* Assigment of value for LCD9 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD10_Pos                  _UINT32_(10)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD10_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD10_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD10(value)               (SLCDC_SMR0_LCD10_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD10_Pos)) /* Assigment of value for LCD10 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD11_Pos                  _UINT32_(11)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD11_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD11_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD11(value)               (SLCDC_SMR0_LCD11_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD11_Pos)) /* Assigment of value for LCD11 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD12_Pos                  _UINT32_(12)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD12_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD12_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD12(value)               (SLCDC_SMR0_LCD12_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD12_Pos)) /* Assigment of value for LCD12 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD13_Pos                  _UINT32_(13)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD13_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD13_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD13(value)               (SLCDC_SMR0_LCD13_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD13_Pos)) /* Assigment of value for LCD13 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD14_Pos                  _UINT32_(14)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD14_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD14_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD14(value)               (SLCDC_SMR0_LCD14_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD14_Pos)) /* Assigment of value for LCD14 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD15_Pos                  _UINT32_(15)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD15_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD15_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD15(value)               (SLCDC_SMR0_LCD15_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD15_Pos)) /* Assigment of value for LCD15 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD16_Pos                  _UINT32_(16)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD16_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD16_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD16(value)               (SLCDC_SMR0_LCD16_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD16_Pos)) /* Assigment of value for LCD16 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD17_Pos                  _UINT32_(17)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD17_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD17_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD17(value)               (SLCDC_SMR0_LCD17_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD17_Pos)) /* Assigment of value for LCD17 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD18_Pos                  _UINT32_(18)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD18_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD18_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD18(value)               (SLCDC_SMR0_LCD18_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD18_Pos)) /* Assigment of value for LCD18 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD19_Pos                  _UINT32_(19)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD19_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD19_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD19(value)               (SLCDC_SMR0_LCD19_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD19_Pos)) /* Assigment of value for LCD19 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD20_Pos                  _UINT32_(20)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD20_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD20_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD20(value)               (SLCDC_SMR0_LCD20_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD20_Pos)) /* Assigment of value for LCD20 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD21_Pos                  _UINT32_(21)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD21_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD21_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD21(value)               (SLCDC_SMR0_LCD21_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD21_Pos)) /* Assigment of value for LCD21 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD22_Pos                  _UINT32_(22)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD22_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD22_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD22(value)               (SLCDC_SMR0_LCD22_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD22_Pos)) /* Assigment of value for LCD22 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD23_Pos                  _UINT32_(23)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD23_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD23_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD23(value)               (SLCDC_SMR0_LCD23_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD23_Pos)) /* Assigment of value for LCD23 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD24_Pos                  _UINT32_(24)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD24_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD24_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD24(value)               (SLCDC_SMR0_LCD24_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD24_Pos)) /* Assigment of value for LCD24 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD25_Pos                  _UINT32_(25)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD25_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD25_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD25(value)               (SLCDC_SMR0_LCD25_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD25_Pos)) /* Assigment of value for LCD25 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD26_Pos                  _UINT32_(26)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD26_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD26_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD26(value)               (SLCDC_SMR0_LCD26_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD26_Pos)) /* Assigment of value for LCD26 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD27_Pos                  _UINT32_(27)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD27_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD27_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD27(value)               (SLCDC_SMR0_LCD27_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD27_Pos)) /* Assigment of value for LCD27 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD28_Pos                  _UINT32_(28)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD28_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD28_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD28(value)               (SLCDC_SMR0_LCD28_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD28_Pos)) /* Assigment of value for LCD28 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD29_Pos                  _UINT32_(29)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD29_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD29_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD29(value)               (SLCDC_SMR0_LCD29_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD29_Pos)) /* Assigment of value for LCD29 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD30_Pos                  _UINT32_(30)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD30_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD30_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD30(value)               (SLCDC_SMR0_LCD30_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD30_Pos)) /* Assigment of value for LCD30 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_LCD31_Pos                  _UINT32_(31)                                         /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Position */
#define SLCDC_SMR0_LCD31_Msk                  (_UINT32_(0x1) << SLCDC_SMR0_LCD31_Pos)              /* (SLCDC_SMR0) LCD Segment Mapped on SEGx I/O Pin Mask */
#define SLCDC_SMR0_LCD31(value)               (SLCDC_SMR0_LCD31_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD31_Pos)) /* Assigment of value for LCD31 in the SLCDC_SMR0 register */
#define SLCDC_SMR0_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (SLCDC_SMR0) Register Mask  */

#define SLCDC_SMR0_LCD_Pos                    _UINT32_(0)                                          /* (SLCDC_SMR0 Position) LCD Segment Mapped on SEGx I/O Pin */
#define SLCDC_SMR0_LCD_Msk                    (_UINT32_(0xFFFFFFFF) << SLCDC_SMR0_LCD_Pos)         /* (SLCDC_SMR0 Mask) LCD */
#define SLCDC_SMR0_LCD(value)                 (SLCDC_SMR0_LCD_Msk & (_UINT32_(value) << SLCDC_SMR0_LCD_Pos)) 

/* -------- SLCDC_WPMR : (SLCDC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define SLCDC_WPMR_WPEN_Pos                   _UINT32_(0)                                          /* (SLCDC_WPMR) Write Protection Enable Position */
#define SLCDC_WPMR_WPEN_Msk                   (_UINT32_(0x1) << SLCDC_WPMR_WPEN_Pos)               /* (SLCDC_WPMR) Write Protection Enable Mask */
#define SLCDC_WPMR_WPEN(value)                (SLCDC_WPMR_WPEN_Msk & (_UINT32_(value) << SLCDC_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the SLCDC_WPMR register */
#define SLCDC_WPMR_WPITEN_Pos                 _UINT32_(1)                                          /* (SLCDC_WPMR) Write Protection Interrupt Enable Position */
#define SLCDC_WPMR_WPITEN_Msk                 (_UINT32_(0x1) << SLCDC_WPMR_WPITEN_Pos)             /* (SLCDC_WPMR) Write Protection Interrupt Enable Mask */
#define SLCDC_WPMR_WPITEN(value)              (SLCDC_WPMR_WPITEN_Msk & (_UINT32_(value) << SLCDC_WPMR_WPITEN_Pos)) /* Assigment of value for WPITEN in the SLCDC_WPMR register */
#define SLCDC_WPMR_WPCREN_Pos                 _UINT32_(2)                                          /* (SLCDC_WPMR) Write Protection Control Enable Position */
#define SLCDC_WPMR_WPCREN_Msk                 (_UINT32_(0x1) << SLCDC_WPMR_WPCREN_Pos)             /* (SLCDC_WPMR) Write Protection Control Enable Mask */
#define SLCDC_WPMR_WPCREN(value)              (SLCDC_WPMR_WPCREN_Msk & (_UINT32_(value) << SLCDC_WPMR_WPCREN_Pos)) /* Assigment of value for WPCREN in the SLCDC_WPMR register */
#define SLCDC_WPMR_WPKEY_Pos                  _UINT32_(8)                                          /* (SLCDC_WPMR) Write Protection Key Position */
#define SLCDC_WPMR_WPKEY_Msk                  (_UINT32_(0xFFFFFF) << SLCDC_WPMR_WPKEY_Pos)         /* (SLCDC_WPMR) Write Protection Key Mask */
#define SLCDC_WPMR_WPKEY(value)               (SLCDC_WPMR_WPKEY_Msk & (_UINT32_(value) << SLCDC_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the SLCDC_WPMR register */
#define   SLCDC_WPMR_WPKEY_PASSWD_Val         _UINT32_(0x534C43)                                   /* (SLCDC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define SLCDC_WPMR_WPKEY_PASSWD               (SLCDC_WPMR_WPKEY_PASSWD_Val << SLCDC_WPMR_WPKEY_Pos) /* (SLCDC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define SLCDC_WPMR_Msk                        _UINT32_(0xFFFFFF07)                                 /* (SLCDC_WPMR) Register Mask  */


