Microchip-MPLAB-Harmony/smartenergy/apps/dual_core_demo/firmware/src/packs/PIC32CX2051MTSH128S1_DFP/component/slcdc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SLCDC register API structure */
typedef struct
{
  __O   uint32_t                       SLCDC_CR;           /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       SLCDC_MR;           /**< Offset: 0x04 (R/W  32) Mode Register */
  __IO  uint32_t                       SLCDC_FRR;          /**< Offset: 0x08 (R/W  32) Frame Rate Register */
  __IO  uint32_t                       SLCDC_DR;           /**< Offset: 0x0C (R/W  32) Display Register */
  __I   uint32_t                       SLCDC_SR;           /**< Offset: 0x10 (R/   32) Status Register */
  __I   uint8_t                        Reserved1[0x0C];
  __O   uint32_t                       SLCDC_IER;          /**< Offset: 0x20 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       SLCDC_IDR;          /**< Offset: 0x24 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       SLCDC_IMR;          /**< Offset: 0x28 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       SLCDC_ISR;          /**< Offset: 0x2C (R/   32) Interrupt Status Register */
  __IO  uint32_t                       SLCDC_SMR0;         /**< Offset: 0x30 (R/W  32) Segment Map Register 0 */
  __I   uint8_t                        Reserved2[0xB0];
  __IO  uint32_t                       SLCDC_WPMR;         /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint8_t                        Reserved3[0x118];
  __IO  uint32_t                       SLCDC_LMEMR0;       /**< Offset: 0x200 (R/W  32) LSB Memory Register (com = 0) */
  __I   uint8_t                        Reserved4[0x04];
  __IO  uint32_t                       SLCDC_LMEMR1;       /**< Offset: 0x208 (R/W  32) LSB Memory Register (com = 1) */
  __I   uint8_t                        Reserved5[0x04];
  __IO  uint32_t                       SLCDC_LMEMR2;       /**< Offset: 0x210 (R/W  32) LSB Memory Register (com = 2) */
  __I   uint8_t                        Reserved6[0x04];
  __IO  uint32_t                       SLCDC_LMEMR3;       /**< Offset: 0x218 (R/W  32) LSB Memory Register (com = 3) */
  __I   uint8_t                        Reserved7[0x04];
  __IO  uint32_t                       SLCDC_LMEMR4;       /**< Offset: 0x220 (R/W  32) LSB Memory Register (com = 4) */
  __I   uint8_t                        Reserved8[0x04];
  __IO  uint32_t                       SLCDC_LMEMR5;       /**< Offset: 0x228 (R/W  32) LSB Memory Register (com = 5) */
  __I   uint8_t                        Reserved9[0x04];
  __IO  uint32_t                       SLCDC_LMEMR6;       /**< Offset: 0x230 (R/W  32) LSB Memory Register (com = 6) */
  __I   uint8_t                        Reserved10[0x04];
  __IO  uint32_t                       SLCDC_LMEMR7;       /**< Offset: 0x238 (R/W  32) LSB Memory Register (com = 7) */
} slcdc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXMTSH_SLCDC_COMPONENT_H_ */
